Enterprise_Serivces/Prod/SilverGroup2/StoreInformation-HopsService/result1/Iteration1/t2_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/storeinformation/contracts/2011/02/IHopsService/GetActiveHopsForStore</wsa:Action><wsa:MessageID>uuid:778017e4-6180-452c-ac01-20b054e2d6fd</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslstoreinformationserviceqa1.testgs.pvt/HopsService.svc</wsa:To></soap:Header><soap:Body><GetActiveHopsForStore xmlns="http://www.gamestop.com/services/csl/storeinformation/contracts/2011/02"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CountryCode xmlns="http://www.gamestop.com/services/csl/storeinformation/contracts/messages/2011/02">US</CountryCode><StoreNumber xmlns="http://www.gamestop.com/services/csl/storeinformation/contracts/messages/2011/02">16</StoreNumber><StoreStatus xmlns="http://www.gamestop.com/services/csl/storeinformation/contracts/messages/2011/02">Open</StoreStatus></request></GetActiveHopsForStore></soap:Body></soap:Envelope>